tutorials/rhoSimpleFoamFlamelets/Sandia_HE0/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\               
| =========                 |                                                 |                
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |                
|  \\    /   O peration     | Version:  1.0                                   |                
|   \\  /    A nd           | Web:      http://www.openfoam.org               |                
|    \\/     M anipulation  |                                                 |                
\*---------------------------------------------------------------------------*/                
                                        
FoamFile                                
{                                       
    version         2.0;                
    format          ascii;              
                                        
    root            "";               
    case            "";               
    instance        "";               
    local           "";               
                                        
    class           dictionary;         
    object          blockMeshDict;      
}                                       
                                        
                                        
                                        
convertToMeters 0.001;                  
                                        
vertices                                
(                                       
   (0.000000000000e+00 0.000000000000e+00 0.000000000000e+00)   // 0
   (1.873215415466e+00 8.178635131001e-02 0.000000000000e+00)   // 1
   (1.873215415466e+00 8.178635131001e-02 8.625000000000e+02)   // 2

   (0.000000000000e+00 0.000000000000e+00 8.625000000000e+02)   // 3
   (1.873215415466e+00 -8.178635131001e-02 0.000000000000e+00)   // 4
   (1.873215415466e+00 -8.178635131001e-02 8.625000000000e+02)   // 5

   (0.000000000000e+00 0.000000000000e+00 -7.000000000000e+01)   // 6
   (1.873215415466e+00 8.178635131001e-02 -7.000000000000e+01)   // 7
   (1.873215415466e+00 -8.178635131001e-02 -7.000000000000e+01)   // 8

   (2.417696696228e+00 1.055589174241e-01 0.000000000000e+00)   // 9
   (2.417696696228e+00 -1.055589174241e-01 0.000000000000e+00)   // 10
   (2.417696696228e+00 1.055589174241e-01 8.625000000000e+02)   // 11
   (2.417696696228e+00 -1.055589174241e-01 8.625000000000e+02)   // 12

   (1.498572332373e+02 6.542908104800e+00 0.000000000000e+00)   // 13
   (1.498572332373e+02 -6.542908104800e+00 0.000000000000e+00)   // 14
   (1.498572332373e+02 6.542908104800e+00 8.625000000000e+02)   // 15
   (1.498572332373e+02 -6.542908104800e+00 8.625000000000e+02)   // 16

   (2.417696696228e+00 1.055589174241e-01 -7.000000000000e+01)   // 17
   (1.498572332373e+02 6.542908104800e+00 -7.000000000000e+01)   // 18
   (1.498572332373e+02 -6.542908104800e+00 -7.000000000000e+01)   // 19
   (2.417696696228e+00 -1.055589174241e-01 -7.000000000000e+01)   // 20

);

blocks
( 	
	hex (0 4 1 0 3 5 2 3)         (3  1 90 )   simpleGrading (1.000000000000e+00 1.000000000000e+00  12.000000000000e+00)
	hex (6 8 7 6 0 4 1 0)         (3  1 15 )   simpleGrading (1.000000000000e+00 1.000000000000e+00   2.000000000000e-01)
	hex (4 10 9 1 5 12 11 2)      (1  1 90 )   simpleGrading (1.000000000000e+00 1.000000000000e+00  12.000000000000e+00)
	hex (10 14 13 9 12 16 15 11)  (44 1 90 )   simpleGrading (14.000000000000e+00 1.000000000000e+00 12.000000000000e+00)
	hex (20 19 18 17 10 14 13 9)  (44 1 15 )   simpleGrading (14.000000000000e+00 1.000000000000e+00  2.000000000000e-01)
);
                                     
edges                                
(                                    
);                                   
                                     
patches                              
(                                    
    patch inletfuel                  
    (                                
        (6 7 8 6)                    
    )                                
                                     
    patch inletair                   
    (                                
        (19 20 17 18)                
    )                                
                                     
    patch outlet                     
    (                                
        (2 3 3 5)                    
        (12 11 2 5)                  
        (16 15 11 12)                
    )                                
                                     
    empty axis                       
    (                                
        (3 0 0 3)                    
        (0 6 6 0)                    
    )                                
                                     
    wall leftside                    
    (                                
        (14 13 15 16)                
        (19 18 13 14)                
    )                                
                                     
    wall burnerwall                  
    (                                
        (8 7 1 4)                    
        (10 9 17 20)                 
        (4 1 9 10)                   
    )                                
                                     
    wedge front                      
    (                                
	    (1 0 3 2)                    
        (7 6 0 1)                    
        (9 1 2 11)                   
        (13 9 11 15)                 
        (18 17 9 13)                 
    )                                
                                     
    wedge back                       
    (                                
	    (5 3 0 4)                    
        (4 0 6 8)                    
        (12 5 4 10)                  
        (16 12 10 14)                
        (19 14 10 20)                
    )                                
                                     
);                                   
                                     
mergePatchPairs                      
(                                    
);                                   
                                     
