tutorials/rhoSimpleFoamFlamelets/Sandia_HE0/0/H
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          H;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions    [ 0 2 -2 0 0 0 0 ];


internalField   uniform -101000.;

boundaryField
{
    inletfuel           
    {
        type  fixedValue;
 	value uniform -43890.3;
    }

    inletair           
    {
        type  fixedValue;
 	value uniform -101000.;
    }

    outlet          
    {
        type  zeroGradient;
    }

    leftside       
    {
        type  fixedValue;
 	value uniform -101000.;
    }

    burnerwall
    {
        type  zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
